{
  "backend/main.mo": "Backend actor implementing access control, user profiles, rank definitions, and player stats with query and update methods.",
  "feature_evidence.json": "Feature evidence report linking features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend files used for reference.",
  "frontend/DEPLOYMENT.md": "Deployment checklist detailing verification steps for matchmaking, UI flows, error handling, and rollback procedures.",
  "frontend/index.css": "Global Tailwind CSS setup defining color variables and themes for light and dark modes.",
  "frontend/index.html": "Base HTML document mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router routes and global providers.",
  "frontend/src/components/AppFooter.tsx": "Footer component showing copyright, branding, and caffeine.ai referral link.",
  "frontend/src/components/AppHeader.tsx": "Navigation header with logo, route buttons, profile display, and login button.",
  "frontend/src/components/AppShell.tsx": "Layout wrapper combining header, main content slot, and footer.",
  "frontend/src/components/BuyGoonFighterButton.tsx": "Purchase button that creates a Stripe checkout session and redirects the user to payment.",
  "frontend/src/components/CombatOutcomeCard.tsx": "Displays combat results with winner/loser info, health, rounds, and victory/defeat styling. Shows bonus points alert when the player wins.",
  "frontend/src/components/LoginButton.tsx": "Provides a login/logout button using Internet Identity with loading state and error handling. Clears queries on logout.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Shows a dialog prompting new authenticated users to set a display name. Saves the profile and handles validation and loading states.",
  "frontend/src/components/RankBadge.tsx": "Renders a styled badge showing a player's rank and point total. Supports multiple size options.",
  "frontend/src/components/StripeSetupDialog.tsx": "Modal for entering Stripe secret key and allowed countries, saving configuration via mutation. Includes validation and success/error toasts.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user's identity, refreshing dependent queries when the actor changes. Initializes access control with an optional admin token.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity login state, stored identity loading, and AuthClient setup.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for user profiles, ranks, stats, leaderboard, matchmaking, match results, and combat actions using the backend actor.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for light/dark themes, including colors and utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider and loads global styles.",
  "frontend/src/pages/Landing.tsx": "Landing page showing hero section and cards linking to multiplayer and story mode.",
  "frontend/src/pages/Leaderboard.tsx": "Displays global leaderboard, fetching player stats and ranks with loading and empty states.",
  "frontend/src/pages/Multiplayer.tsx": "Handles matchmaking, combat resolution, and UI for online multiplayer battles.",
  "frontend/src/pages/PaymentFailure.tsx": "Shows payment cancellation message with navigation options to retry or return home.",
  "frontend/src/pages/PaymentSuccess.tsx": "Processes Stripe session status, unlocks story mode access, and displays success or error states.",
  "frontend/src/pages/StoryMode.tsx": "Manages story mode progression, access checks, Stripe config handling, and encounter combat resolution.",
  "frontend/src/types/combat.ts": "Defines the CombatResult interface for combat outcomes.",
  "frontend/src/utils/combatErrors.ts": "Normalizes combat-related errors into user-friendly messages.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL params (including hash-based), store/retrieve them in sessionStorage, and clear them for persistence and cleanup.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, content paths, extended theme settings, custom colors, animations, and plugins.",
  "project_state.json": "Stores project metadata, feature list, known issues, and architectural notes for the Goon Life game state."
}